/* ######################################################
	@ name :: 자주사용되는 수학관련 함수
	@ author : jungheebum
	@ date : 070908
##################################################### */


/*++++++++++++++++++++++++++++++++++++++++++++++
	@ name :: 앵글 -> 라디안
+++++++++++++++++++++++++++++++++++++++++++++ */
function hb_getAToR(a:Number):Number {
	return a*(Math.PI/180);
}

/*++++++++++++++++++++++++++++++++++++++++++++++
	@ name :: 라디안 -> 앵글
+++++++++++++++++++++++++++++++++++++++++++++ */
function hb_getRToA(r:Number):Number {
	return r*(180/Math.PI);
}

/*++++++++++++++++++++++++++++++++++++++++++++++
	@ name :: 호의 길이
+++++++++++++++++++++++++++++++++++++++++++++ */
function hb_getArcL(r:Number, t:Number):Number {
	return r*t;
}

/*++++++++++++++++++++++++++++++++++++++++++++++
	@ name :: 호의 넓이
		단위면적단위 적용 하니까
+++++++++++++++++++++++++++++++++++++++++++++ */
function hb_getArcS(r:Number, t:Number):Number {
	return (Math.pow(r, 2)/2)*t;
}